src/main/resources/ch/swisstopo/bfs/Test_PublicServices.wsdl0.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions targetNamespace="http://www.uid.admin.ch/xmlns/uid-wse" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.uid.admin.ch/xmlns/uid-wse" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsdl:types><xsd:schema targetNamespace="http://www.uid.admin.ch/xmlns/uid-wse/Imports"><xsd:import schemaLocation="https://www.uid-wse-a.admin.ch/V5.0/PublicServices.svc?xsd=xsd0" namespace="http://www.uid.admin.ch/xmlns/uid-wse"/><xsd:import schemaLocation="https://www.uid-wse-a.admin.ch/V5.0/PublicServices.svc?xsd=xsd1" namespace="http://www.ech.ch/xmlns/eCH-0108/5"/><xsd:import schemaLocation="https://www.uid-wse-a.admin.ch/V5.0/PublicServices.svc?xsd=xsd2" namespace="http://www.ech.ch/xmlns/eCH-0098/5"/><xsd:import schemaLocation="https://www.uid-wse-a.admin.ch/V5.0/PublicServices.svc?xsd=xsd3" namespace="http://www.ech.ch/xmlns/eCH-0097/5"/><xsd:import schemaLocation="https://www.uid-wse-a.admin.ch/V5.0/PublicServices.svc?xsd=xsd4" namespace="http://www.ech.ch/xmlns/eCH-0116/4"/><xsd:import schemaLocation="https://www.uid-wse-a.admin.ch/V5.0/PublicServices.svc?xsd=xsd5" namespace="http://www.ech.ch/xmlns/eCH-0007/6"/><xsd:import schemaLocation="https://www.uid-wse-a.admin.ch/V5.0/PublicServices.svc?xsd=xsd6" namespace="http://www.ech.ch/xmlns/eCH-0046/5"/><xsd:import schemaLocation="https://www.uid-wse-a.admin.ch/V5.0/PublicServices.svc?xsd=xsd7" namespace="http://www.ech.ch/xmlns/eCH-0044/4"/><xsd:import schemaLocation="https://www.uid-wse-a.admin.ch/V5.0/PublicServices.svc?xsd=xsd8" namespace="http://www.ech.ch/xmlns/eCH-0010/7"/><xsd:import schemaLocation="https://www.uid-wse-a.admin.ch/V5.0/PublicServices.svc?xsd=xsd9" namespace="http://www.uid.admin.ch/xmlns/uid-wse-shared/2"/><xsd:import schemaLocation="https://www.uid-wse-a.admin.ch/V5.0/PublicServices.svc?xsd=xsd10" namespace="http://www.uid.admin.ch/xmlns/uid-wse/5"/></xsd:schema></wsdl:types><wsdl:message name="IPublicServices_GetOrganisationSample_InputMessage"><wsdl:part name="parameters" element="tns:GetOrganisationSample"/></wsdl:message><wsdl:message name="IPublicServices_GetOrganisationSample_OutputMessage"><wsdl:part name="parameters" element="tns:GetOrganisationSampleResponse"/></wsdl:message><wsdl:message name="IPublicServices_GetOrganisationSample_securityFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:securityFault"/></wsdl:message><wsdl:message name="IPublicServices_GetOrganisationSample_businessFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:businessFault"/></wsdl:message><wsdl:message name="IPublicServices_GetOrganisationSample_infrastructureFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:infrastructureFault"/></wsdl:message><wsdl:message name="IPublicServices_GetByUID_InputMessage"><wsdl:part name="parameters" element="tns:GetByUID"/></wsdl:message><wsdl:message name="IPublicServices_GetByUID_OutputMessage"><wsdl:part name="parameters" element="tns:GetByUIDResponse"/></wsdl:message><wsdl:message name="IPublicServices_GetByUID_securityFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:securityFault"/></wsdl:message><wsdl:message name="IPublicServices_GetByUID_businessFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:businessFault"/></wsdl:message><wsdl:message name="IPublicServices_GetByUID_infrastructureFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:infrastructureFault"/></wsdl:message><wsdl:message name="IPublicServices_Search_InputMessage"><wsdl:part name="parameters" element="tns:Search"/></wsdl:message><wsdl:message name="IPublicServices_Search_OutputMessage"><wsdl:part name="parameters" element="tns:SearchResponse"/></wsdl:message><wsdl:message name="IPublicServices_Search_securityFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:securityFault"/></wsdl:message><wsdl:message name="IPublicServices_Search_businessFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:businessFault"/></wsdl:message><wsdl:message name="IPublicServices_Search_infrastructureFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:infrastructureFault"/></wsdl:message><wsdl:message name="IPublicServices_ValidateVatNumber_InputMessage"><wsdl:part name="parameters" element="tns:ValidateVatNumber"/></wsdl:message><wsdl:message name="IPublicServices_ValidateVatNumber_OutputMessage"><wsdl:part name="parameters" element="tns:ValidateVatNumberResponse"/></wsdl:message><wsdl:message name="IPublicServices_ValidateVatNumber_securityFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:securityFault"/></wsdl:message><wsdl:message name="IPublicServices_ValidateVatNumber_businessFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:businessFault"/></wsdl:message><wsdl:message name="IPublicServices_ValidateVatNumber_infrastructureFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:infrastructureFault"/></wsdl:message><wsdl:message name="IPublicServices_ValidateUID_InputMessage"><wsdl:part name="parameters" element="tns:ValidateUID"/></wsdl:message><wsdl:message name="IPublicServices_ValidateUID_OutputMessage"><wsdl:part name="parameters" element="tns:ValidateUIDResponse"/></wsdl:message><wsdl:message name="IPublicServices_ValidateUID_securityFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:securityFault"/></wsdl:message><wsdl:message name="IPublicServices_ValidateUID_businessFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:businessFault"/></wsdl:message><wsdl:message name="IPublicServices_ValidateUID_infrastructureFaultFault_FaultMessage"><wsdl:part name="detail" element="tns:infrastructureFault"/></wsdl:message><wsdl:portType name="IPublicServices"><wsdl:operation name="GetOrganisationSample"><wsdl:documentation>&lt;summary&gt;&#xD;
            Returns a data sample to demonstrate the structure of eCH-0108:organisationType. The sample contains all mapped fields. All data is fictional. &#xD;
            &lt;/summary&gt;&#xD;
            &lt;returns&gt;Data sample&lt;/returns&gt;</wsdl:documentation><wsdl:input wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/GetOrganisationSample" message="tns:IPublicServices_GetOrganisationSample_InputMessage"/><wsdl:output wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/GetOrganisationSampleResponse" message="tns:IPublicServices_GetOrganisationSample_OutputMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/GetOrganisationSamplesecurityFaultFault" name="securityFaultFault" message="tns:IPublicServices_GetOrganisationSample_securityFaultFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/GetOrganisationSamplebusinessFaultFault" name="businessFaultFault" message="tns:IPublicServices_GetOrganisationSample_businessFaultFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/GetOrganisationSampleinfrastructureFaultFault" name="infrastructureFaultFault" message="tns:IPublicServices_GetOrganisationSample_infrastructureFaultFault_FaultMessage"/></wsdl:operation><wsdl:operation name="GetByUID"><wsdl:documentation>&lt;summary&gt;&#xD;
            Get the core data (Kernmerkmale) of a UID entity by its UID &#xD;
            &lt;/summary&gt;&#xD;
            &lt;param name="uid"&gt;UID of requested UID entity&lt;/param&gt;&#xD;
            &lt;returns&gt;The requested UID entity&lt;/returns&gt;</wsdl:documentation><wsdl:input wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/GetByUID" message="tns:IPublicServices_GetByUID_InputMessage"/><wsdl:output wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/GetByUIDResponse" message="tns:IPublicServices_GetByUID_OutputMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/GetByUIDsecurityFaultFault" name="securityFaultFault" message="tns:IPublicServices_GetByUID_securityFaultFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/GetByUIDbusinessFaultFault" name="businessFaultFault" message="tns:IPublicServices_GetByUID_businessFaultFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/GetByUIDinfrastructureFaultFault" name="infrastructureFaultFault" message="tns:IPublicServices_GetByUID_infrastructureFaultFault_FaultMessage"/></wsdl:operation><wsdl:operation name="Search"><wsdl:documentation>&lt;summary&gt;&#xD;
            Search for UID-Einheiten &#xD;
            &lt;/summary&gt;&#xD;
            &lt;param name="searchParameters"&gt;Search parameters formated as eCH-0108-3-0f document&lt;/param&gt;&#xD;
            &lt;param name="config"&gt;Configuration parameters to customize search behaviour&lt;/param&gt;&#xD;
            &lt;returns&gt;XML-Document of type uid-wse&lt;/returns&gt;</wsdl:documentation><wsdl:input wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/Search" message="tns:IPublicServices_Search_InputMessage"/><wsdl:output wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/SearchResponse" message="tns:IPublicServices_Search_OutputMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/SearchsecurityFaultFault" name="securityFaultFault" message="tns:IPublicServices_Search_securityFaultFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/SearchbusinessFaultFault" name="businessFaultFault" message="tns:IPublicServices_Search_businessFaultFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/SearchinfrastructureFaultFault" name="infrastructureFaultFault" message="tns:IPublicServices_Search_infrastructureFaultFault_FaultMessage"/></wsdl:operation><wsdl:operation name="ValidateVatNumber"><wsdl:documentation>&lt;summary&gt;&#xD;
            Validate a VatNumber &#xD;
            &lt;/summary&gt;&#xD;
            &lt;param name="vatNumber"&gt;VAT number to validate&lt;/param&gt;&#xD;
            &lt;returns&gt;true if exists&lt;/returns&gt;</wsdl:documentation><wsdl:input wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/ValidateVatNumber" message="tns:IPublicServices_ValidateVatNumber_InputMessage"/><wsdl:output wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/ValidateVatNumberResponse" message="tns:IPublicServices_ValidateVatNumber_OutputMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/ValidateVatNumbersecurityFaultFault" name="securityFaultFault" message="tns:IPublicServices_ValidateVatNumber_securityFaultFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/ValidateVatNumberbusinessFaultFault" name="businessFaultFault" message="tns:IPublicServices_ValidateVatNumber_businessFaultFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/ValidateVatNumberinfrastructureFaultFault" name="infrastructureFaultFault" message="tns:IPublicServices_ValidateVatNumber_infrastructureFaultFault_FaultMessage"/></wsdl:operation><wsdl:operation name="ValidateUID"><wsdl:documentation>&lt;summary&gt;&#xD;
            Validate a UID &#xD;
            &lt;/summary&gt;&#xD;
            &lt;param name="uid"&gt;UID to validate. Accepted format: 'CHE123456789' or 'CHE-123.456.789'&lt;/param&gt;&#xD;
            &lt;returns&gt;true if the UID exists in the UID register&lt;/returns&gt;</wsdl:documentation><wsdl:input wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/ValidateUID" message="tns:IPublicServices_ValidateUID_InputMessage"/><wsdl:output wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/ValidateUIDResponse" message="tns:IPublicServices_ValidateUID_OutputMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/ValidateUIDsecurityFaultFault" name="securityFaultFault" message="tns:IPublicServices_ValidateUID_securityFaultFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/ValidateUIDbusinessFaultFault" name="businessFaultFault" message="tns:IPublicServices_ValidateUID_businessFaultFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.uid.admin.ch/xmlns/uid-wse/IPublicServices/ValidateUIDinfrastructureFaultFault" name="infrastructureFaultFault" message="tns:IPublicServices_ValidateUID_infrastructureFaultFault_FaultMessage"/></wsdl:operation></wsdl:portType></wsdl:definitions>